def gen_bin_tree(height, root, left_branch=lambda root: 1.5 * root, right_branch=lambda root: root**2):

    """
    Создаем список из пустых списков в количестве,
    равном высоте дерева + 1. Заполяем его первое значение
    """

    data = [[] for x in range(height + 1)]
    data[0] = [root]

    """
    Заполняем списки по порядку рассмотрения дерева
    """

    for i in range(height):
        for j in range(2**i):
            data[i + 1].append(left_branch(data[i][j]))
            data[i + 1].append(right_branch(data[i][j]))

    return data


"""
Результат работы функции при аргументах height = 4, root = 8:

[
[8],
[12.0, 64],
[18.0, 144.0, 96.0, 4096],
[27.0, 324.0, 216.0, 20736.0, 144.0, 9216.0, 6144.0, 16777216],
[40.5, 729.0, 486.0, 104976.0, 324.0, 46656.0, 31104.0, 429981696.0, 216.0, 20736.0, 13824.0, 84934656.0, 9216.0, 37748736.0, 25165824.0, 281474976710656]
]
"""