def gen_bin_tree(height, root):
    """
    Возвращаем словарь с ключом, равным корню, и со значением,
    равным кортежу из левого и правого значений
    
    Возвращаем рекурсивно до тех пор, пока высота дерева больше 1.
    Как только цикл завершится, возвращаем последнюю пару значений дерева
    """
    while height > 1:
        left_leaf = root + root/2
        right_leaf = root**2
        return {root: (gen_bin_tree(height - 1, left_leaf), gen_bin_tree(height - 1, right_leaf))}
        
    return {root: (root + root/2, root**2)}


"""
Получившееся бинарное дерево при значениях gen_bin_tree(4, 8):
{8:(
    {12.0: (
        {18.0:(
            {27.0: (
                40.5, 729.0
            )}, 
            {324.0: (
                486.0, 104976.0
            )}
        )},
        {144.0: (
            {216.0: (
                324.0, 46656.0
            )}, 
            {20736.0: (
                31104.0, 429981696.0
            )}
        )}
    )},
    {64: (
        {96.0: (
            {144.0: (
                216.0, 20736.0
            )}, 
            {9216.0: (
                13824.0, 84934656.0
            )}
        )},
        {4096: (
            {6144.0: (
                9216.0, 37748736.0
            )}, 
            {16777216: (
                25165824.0, 281474976710656
            )}
        )}
    )}
)}

"""
